
## Terraform Plan Result
```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.resource_group_pet_clinic will be created
  + resource "azurerm_resource_group" "resource_group_pet_clinic" {
      + id       = (known after apply)
      + location = "westus"
      + name     = "petclinic-resource-group"
      + tags     = {
          + "project" = "PetClinic"
        }
    }

  # module.aks.azurerm_kubernetes_cluster.aks_pet will be created
  + resource "azurerm_kubernetes_cluster" "aks_pet" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "akspetdns"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = "westus"
      + name                                = "petclinic-aks-cluster"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "petclinic-resource-group"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = {
          + "Environment" = "Production"
          + "Project"     = "PetClinic"
        }
      + workload_identity_enabled           = false

      + api_server_access_profile (known after apply)

      + auto_scaler_profile (known after apply)

      + default_node_pool {
          + kubelet_disk_type    = (known after apply)
          + max_pods             = (known after apply)
          + name                 = "petnodepool"
          + node_count           = 3
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = (known after apply)
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "standard_b2als_v2"
          + workload_runtime     = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + kubelet_identity (known after apply)

      + network_profile (known after apply)

      + windows_profile (known after apply)
    }

  # module.key_vault.azurerm_key_vault.key_vault will be created
  + resource "azurerm_key_vault" "key_vault" {
      + access_policy                 = [
          + {
              + key_permissions    = [
                  + "Get",
                  + "List",
                ]
              + object_id          = "b6ae534a-d160-4bb5-b412-1510bff6fe58"
              + secret_permissions = [
                  + "Get",
                  + "List",
                ]
              + tenant_id          = "e994072b-523e-4bfe-86e2-442c5e10b244"
            },
        ]
      + enabled_for_disk_encryption   = true
      + id                            = (known after apply)
      + location                      = "westus"
      + name                          = "petskeyvault-2024-10-10"
      + public_network_access_enabled = true
      + purge_protection_enabled      = true
      + resource_group_name           = "petclinic-resource-group"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tenant_id                     = "e994072b-523e-4bfe-86e2-442c5e10b244"
      + vault_uri                     = (known after apply)

      + contact (known after apply)

      + network_acls (known after apply)
    }

  # module.sql_database.azurerm_sql_database.sql_database will be created
  + resource "azurerm_sql_database" "sql_database" {
      + collation                        = (known after apply)
      + create_mode                      = "Default"
      + creation_date                    = (known after apply)
      + default_secondary_location       = (known after apply)
      + edition                          = (known after apply)
      + elastic_pool_name                = (known after apply)
      + encryption                       = (known after apply)
      + id                               = (known after apply)
      + location                         = "westus"
      + max_size_bytes                   = (known after apply)
      + max_size_gb                      = (known after apply)
      + name                             = "pets-sql-database"
      + read_scale                       = false
      + requested_service_objective_id   = (known after apply)
      + requested_service_objective_name = (known after apply)
      + resource_group_name              = "petclinic-resource-group"
      + restore_point_in_time            = (known after apply)
      + server_name                      = "pets-sql-server"
      + source_database_deletion_date    = (known after apply)
      + source_database_id               = (known after apply)
      + tags                             = {
          + "environment" = "Development"
        }

      + threat_detection_policy (known after apply)
    }

  # module.sql_database.azurerm_sql_server.sql_server will be created
  + resource "azurerm_sql_server" "sql_server" {
      + administrator_login          = "myadmin"
      + administrator_login_password = (sensitive value)
      + connection_policy            = "Default"
      + fully_qualified_domain_name  = (known after apply)
      + id                           = (known after apply)
      + location                     = "westus"
      + name                         = "pets-sql-server"
      + resource_group_name          = "petclinic-resource-group"
      + tags                         = {
          + "environment" = "Development"
        }
      + version                      = "12.0"

      + threat_detection_policy (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aks_cluster_name           = "petclinic-aks-cluster"
  + aks_cluster_principal_id   = (known after apply)
  + aks_cluster_resource_group = (known after apply)

```
